#+author: Nícolas Morazotti
#+title: Spherical Decoder via Neural Networks
#+options: ':t toc:nil author:t date:t title:t tex:t latex:t 
#+options: todo:nil d:nil stat:nil
#+exclude_tags: noexport
#+bibliography:/home/nicolas/Dropbox/USP/referencias.bib
#+startup: inlineimages content indent showstars hideblocks align
#+lang: br
#+todo: TODO(t) WAITING(w) IN-PROGRESS(p) | DONE(d) ABANDONED(b@)

* Lattice implementation
We will implement a lattice as discussed by
cite:mohammadkarimi_deep_2019. To do so, let us begin importing all
necessary libraries.

#+name: libraries
#+BEGIN_SRC jupyter-python :session py :exports both :results none :eval never-export :async yes :tangle yes
  import matplotlib.pyplot as plt
  import numpy as np
  import pandas as pd

  from keras.models import Sequential
  from keras.layers import Dense, Lambda
  from keras import backend as K

  import tensorflow as tf

  from sklearn.cluster import KMeans
  from sklearn.utils import shuffle
#+END_SRC

The lattice basis can be written as follows
#+name: lattice_basis
#+BEGIN_SRC jupyter-python :session py :exports code :results none :eval never-export :async yes :tangle yes
  J = np.eye(3)
#+END_SRC
and we can write the whole lattice centers as 
#+name: lattice_centers
#+BEGIN_SRC jupyter-python :session py :exports code :results raw :eval never-export :async yes :tangle yes
  lattice_range = range(-10, 11)
  global lattice
  lattice = np.array([[i,j,k]@J
                      for i in lattice_range
                      for j in lattice_range
                      for k in lattice_range])
#+END_SRC

#+RESULTS: lattice_centers

To list which points \(\lambda\in\Lambda\) are within a distance \(r\) to a
given point \(y \not\in \Lambda\), we check
\begin{align}
  |\lambda-y| \leq r.
\end{align}

#+BEGIN_SRC jupyter-python :session py :exports code :results raw :eval never-export :async yes :tangle yes
  def points_within(r, y):
      tof = np.linalg.norm(lattice-y, axis = 1) < r 
      return lattice[tof]

  def get_radius(lp, y):
      return np.linalg.norm(lp-y, axis = 1)
#+END_SRC

#+RESULTS:

To train our lattice, we need data. To obtain it, we will use the KMeans
method as discussed [[file:~/Dropbox/USP/Doutorado/quali/quali.pdf][here]]. We will generate \(10^6\) points to train our
lattice, and find our radius using =get_radius= function.
#+name: dummy_data
#+BEGIN_SRC jupyter-python :session py :exports code :results none :eval never-export :async yes :tangle yes
  data = 20*np.random.random([1_000_000, 3])@J - 10
#+END_SRC

We will use a previous method of finding the closest lattice point as a
bridge to gather data to train the neural network: first, we will use
the KMeans method to classify those \(10^6\) points, and use only the
correctly characterized as data for our neural network. The correctly
characterized data has =df["R2"] = 1=.
#+BEGIN_SRC jupyter-python :session py :exports code :results none :eval never :async yes :tangle yes
  sample = data[:100_000]
  n_clusters = lattice.shape[0]
  kmeans = KMeans(n_clusters = n_clusters, init = lattice, random_state = 190794).fit(sample)
  labels = kmeans.predict(data)
#+END_SRC

#+BEGIN_SRC jupyter-python :session py :exports code :results none :eval never :async yes :tangle yes
  cols = {}
  cols["r_x"] = data[:,0]
  cols["r_y"] = data[:,1]
  cols["r_z"] = data[:,2]
  cols["nearest l_x"] = lattice[labels][:,0]
  cols["nearest l_y"] = lattice[labels][:,1]
  cols["nearest l_z"] = lattice[labels][:,2]
  cols["radius"] = get_radius(data, lattice[labels])

  aux = []
  for x,y,z,lx,ly,lz in zip(*[cols[i] for i in cols.keys()]):
      aux.append(r2([lx,ly,lz],[np.round(x), np.round(y), np.round(z)]))
  cols["R2"] = aux

  df = pd.DataFrame(cols)
#+END_SRC

#+BEGIN_SRC jupyter-python :session py :exports results :results output :eval never-export :async yes :tangle yes
  df = pd.read_pickle("dummy_data.pkl")
  print(df[df["R2"] == 1])
#+END_SRC

#+RESULTS:
#+begin_example
               r_x       r_y       r_z  nearest l_x  nearest l_y  nearest l_z  \
  0       3.886191 -6.101527  6.933873          4.0         -6.0          7.0   
  1       0.245916 -6.694230  8.985356          0.0         -7.0          9.0   
  2      -1.636898 -2.999371 -4.994185         -2.0         -3.0         -5.0   
  3      -2.049347  8.003784  8.841865         -2.0          8.0          9.0   
  6      -6.890361 -1.719359 -9.363550         -7.0         -2.0         -9.0   
  ...          ...       ...       ...          ...          ...          ...   
  999992  7.328897  1.057908  2.114701          7.0          1.0          2.0   
  999993  4.358878  8.647659  4.944413          4.0          9.0          5.0   
  999994  8.852299  4.801257  5.064726          9.0          5.0          5.0   
  999996  5.714428 -1.843551 -8.164321          6.0         -2.0         -8.0   
  999998 -4.070636  3.265408 -3.756355         -4.0          3.0         -4.0   

           R2    radius  
  0       1.0  0.166231  
  1       1.0  0.392664  
  2       1.0  0.363149  
  3       1.0  0.165699  
  6       1.0  0.472174  
  ...     ...       ...  
  999992  1.0  0.353105  
  999993  1.0  0.505992  
  999994  1.0  0.255938  
  999996  1.0  0.364731  
  999998  1.0  0.367143  

  [617902 rows x 8 columns]
#+end_example

#+BEGIN_SRC jupyter-python :session py :exports both :results raw :eval never-export :async yes 
  points_within(0.790930, [-7.569034, 7.608160, -0.461634])
#+END_SRC

#+RESULTS:
: array([[-8.,  8.,  0.]])


The activation function of the hidden layer, named CRelu, is a function
that follows
\begin{align}
  CRelu(x) =
  \begin{cases}
    0,& x<0\\
    x,& 0\leq x<1\\
    1,& x\geq 1
  \end{cases}
\end{align}
which can also be written as
\begin{align}
  CRelu(x) = Relu(x) - Relu(x-1)
\end{align}
where
\begin{align}
  Relu(x) =
  \begin{cases}
    0,& x<0\\
    x,& x \geq 0 
  \end{cases}.
\end{align}
#+name: cReLU
#+BEGIN_SRC jupyter-python :session py :exports code :results raw :eval never-export :async yes :tangle yes
  def _crelu(x):
   return K.relu(x) - K.relu(x-1)
#+END_SRC

#+RESULTS: cReLU

The neural network is built by feeding it with the point in question,
\(y\), and the basis matrix, \(J\).

#+name: model_building
#+BEGIN_SRC jupyter-python :session py :exports both :results raw  :eval never-export :async yes :tangle yes :var q = 10
  model = Sequential()
  model.add(Dense(128, input_dim = 220, activation = _crelu))
  model.add(Dense(q, input_dim = 128))
  model.compile(loss='binary_crossentropy', optimizer='adam', metrics=['accuracy'])
  model.summary()
#+END_SRC

#+RESULTS: model_building
#+begin_example
  Model: "sequential_1"
  _________________________________________________________________
  Layer (type)                 Output Shape              Param #   
  =================================================================
  dense (Dense)                (None, 128)               28288     
  _________________________________________________________________
  dense_1 (Dense)              (None, 10)                1290      
  =================================================================
  Total params: 29,578
  Trainable params: 29,578
  Non-trainable params: 0
  _________________________________________________________________
#+end_example

